Repository: ennerperez/HDGraph
Catalog: HDGraphGUI/UserControls/OptionsUserControl.*.resx
Languages: fr

# groupBox2.Text
source: Application startup
fr: Démarrage de l'application

# groupBox1.Text
source: Right click
fr: Menu du clic droit

# tabPageRightClic.Text
source: Application behaviour
fr: Comportement de l'application

# label1.Text
source: This is an anonymous process which will download on the HDGraph website a very small file containing the latest version number.
fr: Cette opération va télécharger, de manière anonyme sur le site web HDGraph.com, un petit fichier contenant le numéro de la dernière version disponible.

# checkBox1.Text
source: Check for updates at application startup.
fr: Vérifier les mise à jour au démarrage de l'application.

# checkBoxAllowDeleteOption.Text
source: Allow to delete folders from the right clic menu
fr: Autoriser la suppression de répertoire via menu du clic droit

# checkBoxDeletionAsk4Confirmation.Text
source: Allways ask for confirmation before deleting a folder
fr: Toujours demander une confirmation avant suppression

# tabPageScanEngine.Text
source: Scan engine
fr: Moteur de scan

# labelScanEngineDesc.Text
source: The scan engine is the component of HDGraph responsible for enumerating the files and folders. It builds a report which will be used by HDGraph to draw the chart.
fr: Le moteur de scan est le composant chargé de l'énumération des fichiers et dossiers. Il établit un rapport qui sera utilisé par HDGraph pour dessiner le graphique.

# groupBoxEngine.Text
source: Choose a scan engine
fr: Choisissez un moteur de scan

# checkBoxIgnoreReparsePoints.Text
source: Exclude reparse points. Check this to NOT follow the symbolic links (and junction points, volume mount points) during the scan, to avoid duplicates. Works only for native engine.
fr: Exclure les liens lors du parcours de l'arborescence. Cochez pour exclure de l'analyse les liens symboliques afin d'éviter les doublons dans le calcul de l'espace occupé. Fonctionne uniquement pour le moteur "natif".

# radioButtonNativeEngine.Text
source: Native engine : use the system native API. This mode is faster and more accurate, but is not guaranteed to work on all systems.
fr: Moteur "natif" : utilise l'API native du système. Ce mode est plus rapide et plus précis, mais son fonctionnement n'est pas garanti sur tous les systèmes.

# radioButtonSimpleEngine.Text
source: Simple engine : use .Net API. This mode is safe (it works on all systems) but is slower and sometimes less accurate.
fr: Moteur standard : utilise l'API .Net. Ce mode est plus robuste (il fonctionne sur tous les systèmes), mais il est moins rapide et peut être moins précis dans certains cas.
